dong-higenis/stm32g4-dmc-balance/firmware/stm32g4-dmc-balance/App/hw/include/imu/icm42670_regs.h
#ifndef ICM42670_REGS_H_
#define ICM42670_REGS_H_

#ifdef __cplusplus
 extern "C" {
#endif

#include "hw_def.h"


#define ICM42670_I2C_ADDR_GND          0x68
#define ICM42670_I2C_ADDR_VCC          0x69
#define ICM42670_WHO_AM_I              0x67

   // Registers USER BANK 0
#define ICM42670_REG_MCLK_RDY          0x00
#define ICM42670_REG_DEVICE_CONFIG     0x01
#define ICM42670_REG_SIGNAL_PATH_RESET 0x02
#define ICM42670_REG_DRIVE_CONFIG1     0x03
#define ICM42670_REG_DRIVE_CONFIG2     0x04
#define ICM42670_REG_DRIVE_CONFIG3     0x05
#define ICM42670_REG_INT_CONFIG        0x06
#define ICM42670_REG_TEMP_DATA1        0x09
#define ICM42670_REG_TEMP_DATA0        0x0A
#define ICM42670_REG_ACCEL_DATA_X1     0x0B
#define ICM42670_REG_ACCEL_DATA_X0     0x0C
#define ICM42670_REG_ACCEL_DATA_Y1     0x0D
#define ICM42670_REG_ACCEL_DATA_Y0     0x0E
#define ICM42670_REG_ACCEL_DATA_Z1     0x0F
#define ICM42670_REG_ACCEL_DATA_Z0     0x10
#define ICM42670_REG_GYRO_DATA_X1      0x11
#define ICM42670_REG_GYRO_DATA_X0      0x12
#define ICM42670_REG_GYRO_DATA_Y1      0x13
#define ICM42670_REG_GYRO_DATA_Y0      0x14
#define ICM42670_REG_GYRO_DATA_Z1      0x15
#define ICM42670_REG_GYRO_DATA_Z0      0x16
#define ICM42670_REG_TMST_FSYNCH       0x17
#define ICM42670_REG_TMST_FSYNCL       0x18
#define ICM42670_REG_APEX_DATA4        0x1D
#define ICM42670_REG_APEX_DATA5        0x1E
#define ICM42670_REG_PWR_MGMT0         0x1F
#define ICM42670_REG_GYRO_CONFIG0      0x20
#define ICM42670_REG_ACCEL_CONFIG0     0x21
#define ICM42670_REG_TEMP_CONFIG0      0x22
#define ICM42670_REG_GYRO_CONFIG1      0x23
#define ICM42670_REG_ACCEL_CONFIG1     0x24
#define ICM42670_REG_APEX_CONFIG0      0x25
#define ICM42670_REG_APEX_CONFIG1      0x26
#define ICM42670_REG_WOM_CONFIG        0x27
#define ICM42670_REG_FIFO_CONFIG1      0x28
#define ICM42670_REG_FIFO_CONFIG2      0x29
#define ICM42670_REG_FIFO_CONFIG3      0x2A
#define ICM42670_REG_INT_SOURCE0       0x2B
#define ICM42670_REG_INT_SOURCE1       0x2C
#define ICM42670_REG_INT_SOURCE3       0x2D
#define ICM42670_REG_INT_SOURCE4       0x2E
#define ICM42670_REG_FIFO_LOST_PKT0    0x2F
#define ICM42670_REG_FIFO_LOST_PKT1    0x30
#define ICM42670_REG_APEX_DATA0        0x31
#define ICM42670_REG_APEX_DATA1        0x32
#define ICM42670_REG_APEX_DATA2        0x33
#define ICM42670_REG_APEX_DATA3        0x34
#define ICM42670_REG_INTF_CONFIG0      0x35
#define ICM42670_REG_INTF_CONFIG1      0x36
#define ICM42670_REG_INT_STATUS_DRDY   0x39
#define ICM42670_REG_INT_STATUS        0x3A
#define ICM42670_REG_INT_STATUS2       0x3B
#define ICM42670_REG_INT_STATUS3       0x3C
#define ICM42670_REG_FIFO_COUNTH       0x3D
#define ICM42670_REG_FIFO_COUNTL       0x3E
#define ICM42670_REG_FIFO_DATA         0x3F
#define ICM42670_REG_WHO_AM_I          0x75
#define ICM42670_REG_BLK_SEL_W         0x79
#define ICM42670_REG_MADDR_W           0x7A
#define ICM42670_REG_M_W               0x7B
#define ICM42670_REG_BLK_SEL_R         0x7C
#define ICM42670_REG_MADDR_R           0x7D
#define ICM42670_REG_M_R               0x7E

   // MREG1 registers
#define ICM42670_REG_TMST_CONFIG1      0x00
#define ICM42670_REG_FIFO_CONFIG5      0x01
#define ICM42670_REG_FIFO_CONFIG6      0x02
#define ICM42670_REG_FSYNC_CONFIG      0x03
#define ICM42670_REG_INT_CONFIG0       0x04
#define ICM42670_REG_INT_CONFIG1       0x05
#define ICM42670_REG_SENSOR_CONFIG3    0x06
#define ICM42670_REG_ST_CONFIG         0x13
#define ICM42670_REG_SELFTEST          0x14
#define ICM42670_REG_INTF_CONFIG6      0x23
#define ICM42670_REG_INTF_CONFIG10     0x25
#define ICM42670_REG_INTF_CONFIG7      0x28
#define ICM42670_REG_OTP_CONFIG        0x2B
#define ICM42670_REG_INT_SOURCE6       0x2F
#define ICM42670_REG_INT_SOURCE7       0x30
#define ICM42670_REG_INT_SOURCE8       0x31
#define ICM42670_REG_INT_SOURCE9       0x32
#define ICM42670_REG_INT_SOURCE10      0x33
#define ICM42670_REG_APEX_CONFIG2      0x44
#define ICM42670_REG_APEX_CONFIG3      0x45
#define ICM42670_REG_APEX_CONFIG4      0x46
#define ICM42670_REG_APEX_CONFIG5      0x47
#define ICM42670_REG_APEX_CONFIG9      0x48
#define ICM42670_REG_APEX_CONFIG10     0x49
#define ICM42670_REG_APEX_CONFIG11     0x4A
#define ICM42670_REG_ACCEL_WOM_X_THR   0x4B
#define ICM42670_REG_ACCEL_WOM_Y_THR   0x4C
#define ICM42670_REG_ACCEL_WOM_Z_THR   0x4D
#define ICM42670_REG_OFFSET_USER0      0x4E
#define ICM42670_REG_OFFSET_USER1      0x4F
#define ICM42670_REG_OFFSET_USER2      0x50
#define ICM42670_REG_OFFSET_USER3      0x51
#define ICM42670_REG_OFFSET_USER4      0x52
#define ICM42670_REG_OFFSET_USER5      0x53
#define ICM42670_REG_OFFSET_USER6      0x54
#define ICM42670_REG_OFFSET_USER7      0x55
#define ICM42670_REG_OFFSET_USER8      0x56
#define ICM42670_REG_ST_STATUS1        0x63
#define ICM42670_REG_ST_STATUS2        0x64
#define ICM42670_REG_FDR_CONFIG        0x66
#define ICM42670_REG_APEX_CONFIG12     0x67

   // MREG2 registers
#define ICM42670_REG_OTP_CTRL7         0x06

   // MREG3 registers
#define ICM42670_REG_XA_ST_DATA        0x00
#define ICM42670_REG_YA_ST_DATA        0x01
#define ICM42670_REG_ZA_ST_DATA        0x02
#define ICM42670_REG_XG_ST_DATA        0x03
#define ICM42670_REG_YG_ST_DATA        0x04
#define ICM42670_REG_ZG_ST_DATA        0x05


 // register structure definitions
#define ICM42670_MCLK_RDY_BITS                    0x08 // ICM42670_REG_MCLK_RDY<3>
#define ICM42670_MCLK_RDY_SHIFT                   3    // ICM42670_REG_MCLK_RDY<3>

#define ICM42670_SPI_AP_4WIRE_BITS                0x04 // ICM42670_REG_DEVICE_CONFIG<2>
#define ICM42670_SPI_AP_4WIRE_SHIFT               2    // ICM42670_REG_DEVICE_CONFIG<2>
#define ICM42670_SPI_MODE_BITS                    0x01 // ICM42670_REG_DEVICE_CONFIG<0>
#define ICM42670_SPI_MODE_SHIFT                   0    // ICM42670_REG_DEVICE_CONFIG<0>

#define ICM42670_SOFT_RESET_DEVICE_CONFIG_BITS    0x10 // ICM42670_REG_SIGNAL_PATH_RESET<4>
#define ICM42670_SOFT_RESET_DEVICE_CONFIG_SHIFT   4    // ICM42670_REG_SIGNAL_PATH_RESET<4>
#define ICM42670_FIFO_FLUSH_BITS                  0x04 // ICM42670_REG_SIGNAL_PATH_RESET<2>
#define ICM42670_FIFO_FLUSH_SHIFT                 2    // ICM42670_REG_SIGNAL_PATH_RESET<2>

#define ICM42670_I3C_DDR_SLEW_RATE_BITS           0x38 // ICM42670_REG_DRIVE_CONFIG1<5:3>
#define ICM42670_I3C_DDR_SLEW_RATE_SHIFT          3    // ICM42670_REG_DRIVE_CONFIG1<5:3>
#define ICM42670_I3C_SDR_SLEW_RATE_BITS           0x07 // ICM42670_REG_DRIVE_CONFIG1<2:0>
#define ICM42670_I3C_SDR_SLEW_RATE_SHIFT          0    // ICM42670_REG_DRIVE_CONFIG1<2:0>

#define ICM42670_I2C_DDR_SLEW_RATE_BITS           0x38 // ICM42670_REG_DRIVE_CONFIG2<5:3>
#define ICM42670_I2C_DDR_SLEW_RATE_SHIFT          3    // ICM42670_REG_DRIVE_CONFIG2<5:3>
#define ICM42670_I2C_SDR_SLEW_RATE_BITS           0x07 // ICM42670_REG_DRIVE_CONFIG2<2:0>
#define ICM42670_I2C_SDR_SLEW_RATE_SHIFT          0    // ICM42670_REG_DRIVE_CONFIG2<2:0>

#define ICM42670_SPI_SLEW_RATE_BITS               0x07 // ICM42670_REG_DRIVE_CONFIG3<2:0>
#define ICM42670_SPI_SLEW_RATE_SHIFT              0    // ICM42670_REG_DRIVE_CONFIG3<2:0>

#define ICM42670_INT2_MODE_BITS                   0x20 // ICM42670_REG_INT_CONFIG<5>
#define ICM42670_INT2_MODE_SHIFT                  5    // ICM42670_REG_INT_CONFIG<5>
#define ICM42670_INT2_DRIVE_CIRCUIT_BITS          0x10 // ICM42670_REG_INT_CONFIG<4>
#define ICM42670_INT2_DRIVE_CIRCUIT_SHIFT         4    // ICM42670_REG_INT_CONFIG<4>
#define ICM42670_INT2_POLARITY_BITS               0x08 // ICM42670_REG_INT_CONFIG<3>
#define ICM42670_INT2_POLARITY_SHIFT              3    // ICM42670_REG_INT_CONFIG<3>
#define ICM42670_INT1_MODE_BITS                   0x04 // ICM42670_REG_INT_CONFIG<2>
#define ICM42670_INT1_MODE_SHIFT                  2    // ICM42670_REG_INT_CONFIG<2>
#define ICM42670_INT1_DRIVE_CIRCUIT_BITS          0x02 // ICM42670_REG_INT_CONFIG<1>
#define ICM42670_INT1_DRIVE_CIRCUIT_SHIFT         1    // ICM42670_REG_INT_CONFIG<1>
#define ICM42670_INT1_POLARITY_BITS               0x01 // ICM42670_REG_INT_CONFIG<0>
#define ICM42670_INT1_POLARITY_SHIFT              0    // ICM42670_REG_INT_CONFIG<0>

#define ICM42670_ACCEL_LP_CLK_SEL_BITS            0x80 // ICM42670_REG_PWR_MGMT0<7>
#define ICM42670_ACCEL_LP_CLK_SEL_SHIFT           7    // ICM42670_REG_PWR_MGMT0<7>
#define ICM42670_IDLE_BITS                        0x10 // ICM42670_REG_PWR_MGMT0<4>
#define ICM42670_IDLE_SHIFT                       4    // ICM42670_REG_PWR_MGMT0<4>
#define ICM42670_GYRO_MODE_BITS                   0x0C // ICM42670_REG_PWR_MGMT0<3:2>
#define ICM42670_GYRO_MODE_SHIFT                  2    // ICM42670_REG_PWR_MGMT0<3:2>
#define ICM42670_ACCEL_MODE_BITS                  0x03 // ICM42670_REG_PWR_MGMT0<1:0>
#define ICM42670_ACCEL_MODE_SHIFT                 0    // ICM42670_REG_PWR_MGMT0<1:0>

#define ICM42670_GYRO_UI_FS_SEL_BITS              0x60 // ICM42670_REG_GYRO_CONFIG0<6:5>
#define ICM42670_GYRO_UI_FS_SEL_SHIFT             5    // ICM42670_REG_GYRO_CONFIG0<6:5>
#define ICM42670_GYRO_ODR_BITS                    0x0F // ICM42670_REG_GYRO_CONFIG0<3:0>
#define ICM42670_GYRO_ODR_SHIFT                   0    // ICM42670_REG_GYRO_CONFIG0<3:0>

#define ICM42670_ACCEL_UI_FS_SEL_BITS             0x60 // ICM42670_REG_ACCEL_CONFIG0<6:5>
#define ICM42670_ACCEL_UI_FS_SEL_SHIFT            5    // ICM42670_REG_ACCEL_CONFIG0<6:5>
#define ICM42670_ACCEL_ODR_BITS                   0x0F // ICM42670_REG_ACCEL_CONFIG0<3:0>
#define ICM42670_ACCEL_ODR_SHIFT                  0    // ICM42670_REG_ACCEL_CONFIG0<3:0>

#define ICM42670_TEMP_FILT_BW_BITS                0x70 // ICM42670_REG_TEMP_CONFIG0<6:4>
#define ICM42670_TEMP_FILT_BW_SHIFT               4    // ICM42670_REG_TEMP_CONFIG0<6:4>

#define ICM42670_GYRO_UI_FILT_BW_BITS             0x07 // ICM42670_REG_GYRO_CONFIG1<2:0>
#define ICM42670_GYRO_UI_FILT_BW_SHIFT            0    // ICM42670_REG_GYRO_CONFIG1<2:0>

#define ICM42670_ACCEL_UI_AVG_BITS                0x70 // ICM42670_REG_ACCEL_CONFIG1<6:4>
#define ICM42670_ACCEL_UI_AVG_SHIFT               4    // ICM42670_REG_ACCEL_CONFIG1<6:4>
#define ICM42670_ACCEL_UI_FILT_BW_BITS            0x07 // ICM42670_REG_ACCEL_CONFIG1<2:0>
#define ICM42670_ACCEL_UI_FILT_BW_SHIFT           0    // ICM42670_REG_ACCEL_CONFIG1<2:0>

#define ICM42670_DMP_POWER_SAVE_EN_BITS           0x08 // ICM42670_REG_APEX_CONFIG0<3>
#define ICM42670_DMP_POWER_SAVE_EN_SHIFT          3    // ICM42670_REG_APEX_CONFIG0<3>
#define ICM42670_DMP_INIT_EN_BITS                 0x04 // ICM42670_REG_APEX_CONFIG0<2>
#define ICM42670_DMP_INIT_EN_SHIFT                2    // ICM42670_REG_APEX_CONFIG0<2>
#define ICM42670_DMP_MEM_RESET_EN_BITS            0x01 // ICM42670_REG_APEX_CONFIG0<0>
#define ICM42670_DMP_MEM_RESET_EN_SHIFT           0    // ICM42670_REG_APEX_CONFIG0<0>

#define ICM42670_SMD_ENABLE_BITS                  0x40 // ICM42670_REG_APEX_CONFIG1<6>
#define ICM42670_SMD_ENABLE_SHIFT                 6    // ICM42670_REG_APEX_CONFIG1<6>
#define ICM42670_FF_ENABLE_BITS                   0x20 // ICM42670_REG_APEX_CONFIG1<5>
#define ICM42670_FF_ENABLE_SHIFT                  5    // ICM42670_REG_APEX_CONFIG1<5>
#define ICM42670_TILT_ENABLE_BITS                 0x10 // ICM42670_REG_APEX_CONFIG1<4>
#define ICM42670_TILT_ENABLE_SHIFT                4    // ICM42670_REG_APEX_CONFIG1<4>
#define ICM42670_PED_ENABLE_BITS                  0x08 // ICM42670_REG_APEX_CONFIG1<3>
#define ICM42670_PED_ENABLE_SHIFT                 3    // ICM42670_REG_APEX_CONFIG1<3>
#define ICM42670_DMP_ODR_BITS                     0x03 // ICM42670_REG_APEX_CONFIG1<1:0>
#define ICM42670_DMP_ODR_SHIFT                    0    // ICM42670_REG_APEX_CONFIG1<1:0>

#define ICM42670_WOM_INT_DUR_BITS                 0x18 // ICM42670_REG_WOM_CONFIG<4:3>
#define ICM42670_WOM_INT_DUR_SHIFT                3    // ICM42670_REG_WOM_CONFIG<4:3>
#define ICM42670_WOM_INT_MODE_BITS                0x04 // ICM42670_REG_WOM_CONFIG<2>
#define ICM42670_WOM_INT_MODE_SHIFT               2    // ICM42670_REG_WOM_CONFIG<2>
#define ICM42670_WOM_MODE_BITS                    0x02 // ICM42670_REG_WOM_CONFIG<1>
#define ICM42670_WOM_MODE_SHIFT                   1    // ICM42670_REG_WOM_CONFIG<1>
#define ICM42670_WOM_EN_BITS                      0x01 // ICM42670_REG_WOM_CONFIG<0>
#define ICM42670_WOM_EN_SHIFT                     0    // ICM42670_REG_WOM_CONFIG<0>

#define ICM42670_FIFO_MODE_BITS                   0x02 // ICM42670_REG_FIFO_CONFIG1<1>
#define ICM42670_FIFO_MODE_SHIFT                  1    // ICM42670_REG_FIFO_CONFIG1<1>
#define ICM42670_FIFO_BYPASS_BITS                 0x01 // ICM42670_REG_FIFO_CONFIG1<0>
#define ICM42670_FIFO_BYPASS_SHIFT                0    // ICM42670_REG_FIFO_CONFIG1<0>

#define ICM42670_ST_INT1_EN_BITS                  0x80 // ICM42670_REG_INT_SOURCE0<7>
#define ICM42670_ST_INT1_EN_SHIFT                 7    // ICM42670_REG_INT_SOURCE0<7>
#define ICM42670_FSYNC_INT1_EN_BITS               0x40 // ICM42670_REG_INT_SOURCE0<6>
#define ICM42670_FSYNC_INT1_EN_SHIFT              6    // ICM42670_REG_INT_SOURCE0<6>
#define ICM42670_PLL_RDY_INT1_EN_BITS             0x20 // ICM42670_REG_INT_SOURCE0<5>
#define ICM42670_PLL_RDY_INT1_EN_SHIFT            5    // ICM42670_REG_INT_SOURCE0<5>
#define ICM42670_RESET_DONE_INT1_EN_BITS          0x10 // ICM42670_REG_INT_SOURCE0<4>
#define ICM42670_RESET_DONE_INT1_EN_SHIFT         4    // ICM42670_REG_INT_SOURCE0<4>
#define ICM42670_DRDY_INT1_EN_BITS                0x08 // ICM42670_REG_INT_SOURCE0<3>
#define ICM42670_DRDY_INT1_EN_SHIFT               3    // ICM42670_REG_INT_SOURCE0<3>
#define ICM42670_FIFO_THS_INT1_EN_BITS            0x04 // ICM42670_REG_INT_SOURCE0<2>
#define ICM42670_FIFO_THS_INT1_EN_SHIFT           2    // ICM42670_REG_INT_SOURCE0<2>
#define ICM42670_FIFO_FULL_INT1_EN_BITS           0x02 // ICM42670_REG_INT_SOURCE0<1>
#define ICM42670_FIFO_FULL_INT1_EN_SHIFT          1    // ICM42670_REG_INT_SOURCE0<1>
#define ICM42670_AGC_RDY_INT1_EN_BITS             0x01 // ICM42670_REG_INT_SOURCE0<0>
#define ICM42670_AGC_RDY_INT1_EN_SHIFT            0    // ICM42670_REG_INT_SOURCE0<0>

#define ICM42670_I3C_PROTOCOL_ERROR_INT1_EN_BITS  0x40 // ICM42670_REG_INT_SOURCE1<6>
#define ICM42670_I3C_PROTOCOL_ERROR_INT1_EN_SHIFT 6    // ICM42670_REG_INT_SOURCE1<6>
#define ICM42670_SMD_INT1_EN_BITS                 0x08 // ICM42670_REG_INT_SOURCE1<3>
#define ICM42670_SMD_INT1_EN_SHIFT                3    // ICM42670_REG_INT_SOURCE1<3>
#define ICM42670_WOM_Z_INT1_EN_BITS               0x04 // ICM42670_REG_INT_SOURCE1<2>
#define ICM42670_WOM_Z_INT1_EN_SHIFT              2    // ICM42670_REG_INT_SOURCE1<2>
#define ICM42670_WOM_Y_INT1_EN_BITS               0x02 // ICM42670_REG_INT_SOURCE1<1>
#define ICM42670_WOM_Y_INT1_EN_SHIFT              1    // ICM42670_REG_INT_SOURCE1<1>
#define ICM42670_WOM_X_INT1_EN_BITS               0x01 // ICM42670_REG_INT_SOURCE1<0>
#define ICM42670_WOM_X_INT1_EN_SHIFT              0    // ICM42670_REG_INT_SOURCE1<0>

   // ICM42670_REG_INT_SOURCE3 and ICM42670_REG_INT_SOURCE4 same as 0 and 1

#define ICM42670_DMP_IDLE_BITS                    0x04 // ICM42670_REG_APEX_DATA3<2>
#define ICM42670_DMP_IDLE_SHIFT                   2    // ICM42670_REG_APEX_DATA3<2>
#define ICM42670_ACTIVITY_CLASS_BITS              0x03 // ICM42670_REG_APEX_DATA3<1:0>
#define ICM42670_ACTIVITY_CLASS_SHIFT             0    // ICM42670_REG_APEX_DATA3<1:0>

#define ICM42670_FIFO_COUNT_FORMAT_BITS           0x40 // ICM42670_REG_INTF_CONFIG0<6>
#define ICM42670_FIFO_COUNT_FORMAT_SHIFT          6    // ICM42670_REG_INTF_CONFIG0<6>
#define ICM42670_FIFO_COUNT_ENDIAN_BITS           0x20 // ICM42670_REG_INTF_CONFIG0<5>
#define ICM42670_FIFO_COUNT_ENDIAN_SHIFT          5    // ICM42670_REG_INTF_CONFIG0<5>
#define ICM42670_SENSOR_DATA_ENDIAN_BITS          0x10 // ICM42670_REG_INTF_CONFIG0<4>
#define ICM42670_SENSOR_DATA_ENDIAN_SHIFT         4    // ICM42670_REG_INTF_CONFIG0<4>

#define ICM42670_I3C_SDR_EN_BITS                  0x08 // ICM42670_REG_INTF_CONFIG1<3>
#define ICM42670_I3C_SDR_EN_SHIFT                 3    // ICM42670_REG_INTF_CONFIG1<3>
#define ICM42670_I3C_DDR_EN_BITS                  0x04 // ICM42670_REG_INTF_CONFIG1<2>
#define ICM42670_I3C_DDR_EN_SHIFT                 2    // ICM42670_REG_INTF_CONFIG1<2>
#define ICM42670_CLKSEL_BITS                      0x03 // ICM42670_REG_INTF_CONFIG1<1:0>
#define ICM42670_CLKSEL_SHIFT                     0    // ICM42670_REG_INTF_CONFIG1<1:0>

#define ICM42670_DATA_RDY_INT_BITS                0x01 // ICM42670_REG_INT_STATUS_DRDY<0>
#define ICM42670_DATA_RDY_INT_SHIFT               0    // ICM42670_REG_INT_STATUS_DRDY<0>

#define ICM42670_ST_INT_BITS                      0x80 // ICM42670_REG_INT_STATUS<7>
#define ICM42670_ST_INT_SHIFT                     7    // ICM42670_REG_INT_STATUS<7>
#define ICM42670_FSYNC_INT_BITS                   0x40 // ICM42670_REG_INT_STATUS<6>
#define ICM42670_FSYNC_INT_SHIFT                  6    // ICM42670_REG_INT_STATUS<6>
#define ICM42670_PLL_RDY_INT_BITS                 0x20 // ICM42670_REG_INT_STATUS<5>
#define ICM42670_PLL_RDY_INT_SHIFT                5    // ICM42670_REG_INT_STATUS<5>
#define ICM42670_RESET_DONE_INT_BITS              0x10 // ICM42670_REG_INT_STATUS<4>
#define ICM42670_RESET_DONE_INT_SHIFT             4    // ICM42670_REG_INT_STATUS<4>
#define ICM42670_FIFO_THS_INT_BITS                0x04 // ICM42670_REG_INT_STATUS<2>
#define ICM42670_FIFO_THS_INT_SHIFT               2    // ICM42670_REG_INT_STATUS<2>
#define ICM42670_FIFO_FULL_INT_BITS               0x02 // ICM42670_REG_INT_STATUS<1>
#define ICM42670_FIFO_FULL_INT_SHIFT              1    // ICM42670_REG_INT_STATUS<1>
#define ICM42670_AGC_RDY_INT_BITS                 0x01 // ICM42670_REG_INT_STATUS<0>
#define ICM42670_AGC_RDY_INT_SHIFT                0    // ICM42670_REG_INT_STATUS<0>

#define ICM42670_SMD_INT_BITS                     0x08 // ICM42670_REG_INT_STATUS2<3>
#define ICM42670_SMD_INT_SHIFT                    3    // ICM42670_REG_INT_STATUS2<3>
#define ICM42670_WOM_X_INT_BITS                   0x04 // ICM42670_REG_INT_STATUS2<2>
#define ICM42670_WOM_X_INT_SHIFT                  2    // ICM42670_REG_INT_STATUS2<2>
#define ICM42670_WOM_Y_INT_BITS                   0x02 // ICM42670_REG_INT_STATUS2<1>
#define ICM42670_WOM_Y_INT_SHIFT                  1    // ICM42670_REG_INT_STATUS2<1>
#define ICM42670_WOM_Z_INT_BITS                   0x01 // ICM42670_REG_INT_STATUS2<0>
#define ICM42670_WOM_Z_INT_SHIFT                  0    // ICM42670_REG_INT_STATUS2<0>

#define ICM42670_STEP_DET_INT_BITS                0x20 // ICM42670_REG_INT_STATUS3<5>
#define ICM42670_STEP_DET_INT_SHIFT               5    // ICM42670_REG_INT_STATUS3<5>
#define ICM42670_STEP_CNT_OVF_INT_BITS            0x10 // ICM42670_REG_INT_STATUS3<4>
#define ICM42670_STEP_CNT_OVF_INT_SHIFT           4    // ICM42670_REG_INT_STATUS3<4>
#define ICM42670_TILT_DET_INT_BITS                0x08 // ICM42670_REG_INT_STATUS3<3>
#define ICM42670_TILT_DET_INT_SHIFT               3    // ICM42670_REG_INT_STATUS3<3>
#define ICM42670_FF_DET_INT_BITS                  0x04 // ICM42670_REG_INT_STATUS3<2>
#define ICM42670_FF_DET_INT_SHIFT                 2    // ICM42670_REG_INT_STATUS3<2>
#define ICM42670_LOWG_DET_INT_BITS                0x02 // ICM42670_REG_INT_STATUS3<1>
#define ICM42670_LOWG_DET_INT_SHIFT               1    // ICM42670_REG_INT_STATUS3<1>


/* Gyro power mode */
typedef enum
{
  ICM42670_GYRO_DISABLE        = 0b00,
  ICM42670_GYRO_STANDBY        = 0b01,
  ICM42670_GYRO_ENABLE_LN_MODE = 0b11
} icm42670_gyro_pwr_mode_t;

/* Accelerometer power mode */
typedef enum
{
  ICM42670_ACCEL_DISABLE        = 0b00,
  ICM42670_ACCEL_ENABLE_LP_MODE = 0b10,
  ICM42670_ACCEL_ENABLE_LN_MODE = 0b11
} icm42670_accel_pwr_mode_t;

/* Accelerometer low power mode clock source */
typedef enum
{
  ICM42670_LP_CLK_WUO = 0,
  ICM42670_LP_CLK_RCO = 1
} icm42670_lp_clock_source_t;

/* Gyro FSR (full scale range) */
typedef enum
{
  ICM42670_GYRO_RANGE_2000DPS = 0b00,
  ICM42670_GYRO_RANGE_1000DPS = 0b01,
  ICM42670_GYRO_RANGE_500DPS  = 0b10,
  ICM42670_GYRO_RANGE_250DPS  = 0b11
} icm42670_gyro_fsr_t;

/* Gyro ODR (output data rate) */
typedef enum
{
  ICM42670_GYRO_ODR_12_5HZ = 0b1100,
  ICM42670_GYRO_ODR_25HZ   = 0b1011,
  ICM42670_GYRO_ODR_50HZ   = 0b1010,
  ICM42670_GYRO_ODR_100HZ  = 0b1001,
  ICM42670_GYRO_ODR_200HZ  = 0b1000,
  ICM42670_GYRO_ODR_400HZ  = 0b0111,
  ICM42670_GYRO_ODR_800HZ  = 0b0110,
  ICM42670_GYRO_ODR_1_6KHZ = 0b0101
} icm42670_gyro_odr_t;

/* Accelerometer FSR (full scale range) */
typedef enum
{
  ICM42670_ACCEL_RANGE_16G = 0b00,
  ICM42670_ACCEL_RANGE_8G  = 0b01,
  ICM42670_ACCEL_RANGE_4G  = 0b10,
  ICM42670_ACCEL_RANGE_2G  = 0b11
} icm42670_accel_fsr_t;

/* Accelerometer ODR (output data rate) */
typedef enum
{
  ICM42670_ACCEL_ODR_1_5625HZ = 0b1111,
  ICM42670_ACCEL_ODR_3_125HZ  = 0b1110,
  ICM42670_ACCEL_ODR_6_25HZ   = 0b1101,
  ICM42670_ACCEL_ODR_12_5HZ   = 0b1100,
  ICM42670_ACCEL_ODR_25HZ     = 0b1011,
  ICM42670_ACCEL_ODR_50HZ     = 0b1010,
  ICM42670_ACCEL_ODR_100HZ    = 0b1001,
  ICM42670_ACCEL_ODR_200HZ    = 0b1000,
  ICM42670_ACCEL_ODR_400HZ    = 0b0111,
  ICM42670_ACCEL_ODR_800HZ    = 0b0110,
  ICM42670_ACCEL_ODR_1_6KHZ   = 0b0101
} icm42670_accel_odr_t;

/* Temperature LPF (low pass filter) */
typedef enum
{
  ICM42670_TEMP_LFP_BYPASSED = 0b000,
  ICM42670_TEMP_LFP_180HZ    = 0b001,
  ICM42670_TEMP_LFP_72HZ     = 0b010,
  ICM42670_TEMP_LFP_34HZ     = 0b011,
  ICM42670_TEMP_LFP_16HZ     = 0b100,
  ICM42670_TEMP_LFP_8HZ      = 0b101,
  ICM42670_TEMP_LFP_4HZ      = 0b110
} icm42670_temp_lfp_t;

/* Gyro LPF (low pass filter) */
typedef enum
{
  ICM42670_GYRO_LFP_BYPASSED = 0b000,
  ICM42670_GYRO_LFP_180HZ    = 0b001,
  ICM42670_GYRO_LFP_121HZ    = 0b010,
  ICM42670_GYRO_LFP_73HZ     = 0b011,
  ICM42670_GYRO_LFP_53HZ     = 0b100,
  ICM42670_GYRO_LFP_34HZ     = 0b101,
  ICM42670_GYRO_LFP_25HZ     = 0b110,
  ICM42670_GYRO_LFP_16HZ     = 0b111
} icm42670_gyro_lfp_t;

/* Accelerometer LPF (low pass filter) */
typedef enum
{
  ICM42670_ACCEL_LFP_BYPASSED = 0b000,
  ICM42670_ACCEL_LFP_180HZ    = 0b001,
  ICM42670_ACCEL_LFP_121HZ    = 0b010,
  ICM42670_ACCEL_LFP_73HZ     = 0b011,
  ICM42670_ACCEL_LFP_53HZ     = 0b100,
  ICM42670_ACCEL_LFP_34HZ     = 0b101,
  ICM42670_ACCEL_LFP_25HZ     = 0b110,
  ICM42670_ACCEL_LFP_16HZ     = 0b111
} icm42670_accel_lfp_t;

/* Accelerometer averaging (for low power mode) */
typedef enum
{
  ICM42670_ACCEL_AVG_2X  = 0b000,
  ICM42670_ACCEL_AVG_4X  = 0b001,
  ICM42670_ACCEL_AVG_8X  = 0b010,
  ICM42670_ACCEL_AVG_16X = 0b011,
  ICM42670_ACCEL_AVG_32X = 0b100,
  ICM42670_ACCEL_AVG_64X = 0b101
} icm42670_accel_avg_t;

/* Interrupt pin signal mode */
typedef enum
{
  ICM42670_INT_MODE_PULSED  = 0,
  ICM42670_INT_MODE_LATCHED = 1
} icm42670_int_mode_t;

/* Interrupt pin signal type */
typedef enum
{
  ICM42670_INT_DRIVE_OPEN_DRAIN = 0,
  ICM42670_INT_DRIVE_PUSH_PULL  = 1
} icm42670_int_drive_t;

/* Interrupt pin signal polarity */
typedef enum
{
  ICM42670_INT_POLARITY_ACTIVE_LOW  = 0,
  ICM42670_INT_POLARITY_ACTIVE_HIGH = 1
} icm42670_int_polarity_t;


#ifdef __cplusplus
 }
#endif

#endif 
